Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.23/samha0ab/atdf/ATSAMHA0E14AB.atdf
      <value-group name="NVMCTRL_CTRLB__RWS">
        <value name="SINGLE" caption="Single Auto Wait State" value="0"/>
        <value name="HALF" caption="Half Auto Wait State" value="1"/>
        <value name="DUAL" caption="Dual Auto Wait State" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2207" version="2.0.2" caption="Non-Volatile Fuses">
      <register-group name="AUX3_FUSES">
        <register name="AUX3_WORD_3" offset="0xC" size="4" rw="R" caption="AUX3 Page Word 3">
          <bitfield name="SERIAL_NUMBER_3" caption="Serial Number word 3" mask="0xFFFFFFFF"/>
        </register>
        <register name="AUX3_WORD_16" offset="0x40" size="4" rw="R" caption="AUX3 Page Word 16">
          <bitfield name="SERIAL_NUMBER_0" caption="Serial Number words 2-0 bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="AUX3_WORD_17" offset="0x44" size="4" rw="R" caption="AUX3 Page Word 17">
          <bitfield name="SERIAL_NUMBER_1" caption="Serial Number words 2-0 bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="AUX3_WORD_18" offset="0x48" size="4" rw="R" caption="AUX3 Page Word 18">
          <bitfield name="SERIAL_NUMBER_2" caption="Serial Number words 2-0 bits 95:64" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="OTP4_FUSES">
        <register name="OTP4_WORD_0" offset="0x0" size="4" rw="R" caption="OTP4 Page Word 0">
          <bitfield name="ADC_LINEARITY_0" caption="ADC Linearity bits 4:0" mask="0xF8000000"/>
        </register>
        <register name="OTP4_WORD_1" offset="0x4" size="4" rw="R" caption="OTP4 Page Word 1">
          <bitfield name="ADC_LINEARITY_1" caption="ADC Linearity bits 7:5" mask="0x7"/>
          <bitfield name="ADC_BIASCAL" caption="ADC Bias Calibration" mask="0x38"/>
          <bitfield name="OSC32K_CAL" caption="OSC32K Calibration" mask="0x1FC0"/>
          <bitfield name="DFLL48M_COARSE_CAL" caption="DFLL48M Coarse Calibration" mask="0xFC000000"/>
        </register>
        <register name="OTP4_WORD_2" offset="0x8" size="4" rw="R" caption="OTP4 Page Word 2">
          <bitfield name="DFLL48M_FINE_CAL" caption="DFLL48M Fine Calibration" mask="0x3FF"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="R" caption="TEMP_LOG Page Word 0">
          <bitfield name="ROOM_TEMP_VAL_INT" caption="Integer part of room temperature in oC" mask="0xFF"/>
          <bitfield name="ROOM_TEMP_VAL_DEC" caption="Decimal part of room temperature" mask="0xF00"/>
          <bitfield name="HOT_TEMP_VAL_INT" caption="Integer part of hot temperature in oC" mask="0xFF000"/>
          <bitfield name="HOT_TEMP_VAL_DEC" caption="Decimal part of hot temperature" mask="0xF00000"/>
          <bitfield name="ROOM_INT1V_VAL" caption="2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)" mask="0xFF000000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" size="4" rw="R" caption="TEMP_LOG Page Word 1">
          <bitfield name="HOT_INT1V_VAL" caption="2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)" mask="0xFF"/>
          <bitfield name="ROOM_ADC_VAL" caption="12-bit ADC conversion at room temperature" mask="0xFFF00"/>
          <bitfield name="HOT_ADC_VAL" caption="12-bit ADC conversion at hot temperature" mask="0xFFF00000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x7" values="USER_FUSES_NVMCTRL__BOOTPROT"/>
          <bitfield name="NVMCTRL_EEPROM_SIZE" caption="EEPROM Size" mask="0x70" values="USER_FUSES_NVMCTRL__EEPROM_SIZE"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x3F00"/>
          <bitfield name="BOD33_EN" caption="BOD33 Enable" mask="0x4000" values="SYSCTRL_BOD33__ENABLE"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0x18000" values="SYSCTRL_BOD33__ACTION"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x2000000" values="WDT__ENABLE"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x4000000" values="WDT__ALWAYSON"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0x78000000" values="WDT_CONFIG__PER"/>
          <bitfield name="WDT_WINDOW_0" caption="WDT Window bit 0" mask="0x80000000"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" size="4" rw="RW" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW_1" caption="WDT Window bits 3:1" mask="0x7"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0x78" values="WDT_EWCTRL__EWOFFSET"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x80" values="WDT__WEN"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x100" values="SYSCTRL_BOD33__HYST"/>
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region Locks" mask="0xFFFF0000"/>
        </register>
      </register-group>
      <value-group name="USER_FUSES_NVMCTRL__BOOTPROT">
        <value name="SIZE_0BYTES" caption="0 Bytes" value="0x7"/>
        <value name="SIZE_512BYTES" caption="512 Bytes" value="0x6"/>
        <value name="SIZE_1024BYTES" caption="1024 Bytes" value="0x5"/>
        <value name="SIZE_2048BYTES" caption="2048 Bytes" value="0x4"/>
        <value name="SIZE_4096BYTES" caption="4096 Bytes" value="0x3"/>
        <value name="SIZE_8192BYTES" caption="8192 Bytes" value="0x2"/>
        <value name="SIZE_16384BYTES" caption="16384 Bytes" value="0x1"/>
        <value name="SIZE_32768BYTES" caption="32768 Bytes" value="0x0"/>
      </value-group>
      <value-group name="USER_FUSES_NVMCTRL__EEPROM_SIZE">
        <value name="SIZE_0BYTES" caption="0 Bytes" value="0x7"/>
        <value name="SIZE_256BYTES" caption="256 Bytes" value="0x6"/>
        <value name="SIZE_512BYTES" caption="512 Bytes" value="0x5"/>
        <value name="SIZE_1024BYTES" caption="1024 Bytes" value="0x4"/>
        <value name="SIZE_2048BYTES" caption="2048 Bytes" value="0x3"/>
        <value name="SIZE_4096BYTES" caption="4096 Bytes" value="0x2"/>
        <value name="SIZE_8192BYTES" caption="8192 Bytes" value="0x1"/>
        <value name="SIZE_16384BYTES" caption="16384 Bytes" value="0x0"/>
      </value-group>
      <value-group name="SYSCTRL_BOD33__ENABLE">
        <value name="DISABLED" caption="BOD33 is disabled" value="0x0"/>
        <value name="ENABLED" caption="BOD33 is enabled" value="0x1"/>
      </value-group>
      <value-group name="SYSCTRL_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INTERRUPT" caption="The BOD33 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="WDT__ENABLE">
        <value name="DISABLED" caption="WDT is disabled" value="0x0"/>
        <value name="ENABLED" caption="WDT is enabled" value="0x1"/>
      </value-group>
